package Lesson1语法与位运算;

public class W位运算 {
	public static void main(String []args) {
	System.out.println("原码与反码与补码");
	/*
	原码：+7 00000111
	    -7  10000111
	反码    +7 00000111
	    -7  11111000  除最高位其余取反
	补码    +7 00000111
	    -7  10000111
	        11111000 取反
	        11111001   在加1
	原码     0  00000000
	反码     0  11111111
	补码     0  00000000   最高位进一舍其去
	11111001  1负号   全部取反00000110  在减一-6-1=-7  
	  
	  十六进制   c-5=7   5+b=16  所以c+b=7
	 */
	System.out.println("位运算符号");
	/*
	 &(与)  |(或)  ^(异或)  ~(取反)
	 01101101
^	 00110111    1亮0暗
	 01011010
	 */
	/*
	 <<左移    >>   >>>无符号右移  
           x           x<<2       x>>2        x>>>2
     17  00010001   00|01000100  00000100|00  00000100|00
    -17  11101111   11|10111111  11111011|11  00111011|11
	 */
	int i=0xffffffff;
	//int c=i<<2;
	//int c=i>>2;
	int c=i>>>2;
	System.out.println(i);
	System.out.println(c);
	System.out.println(Integer.toHexString(c));
	//练习题 ：将一个整数110从右端开始的4-7位变为0.
	}
}
